#include <iostream>
using namespace std;

// Lab 12
// TODO: реализуйте решение по заданию в labs/lab12_combinatorics/README.md
//
// Рекомендация по выводу:
// - без лишнего текста
// - числа через пробел
// - если несколько строк — в фиксированном порядке.

//1
//презентация, поясняющая работу
//алгоритма генерации перестановок 
//мощность 3,
//123
//132
//213


//2
//генерация перестановок ферзей
//2 способа:
//
//1) в лоб с использованием матрицы
int n, P[21][21], cous = 0;/*глобальные описания*/
//P = Position (перестановка, выводимая на экран)

void queen(int k)
{
    int i, j;
    for (i = 1; i <= n; i++)
    {
         if (P[i-1][k] == 0 && P[i+ 1][k- 1] == 0 && P[i - 1][k - 1] == 0)
         {
             P[i][k] = 1;
             if (k == n)
             {
                for (i = 1; i <= n; i++)
                {
                    for (j = 1; j <= n; j++) printf("%2d ", P[i][j]);
                    printf("\n");
                }
                cous += 1;
             }
             else queen(k + 1);
         }
    }
}

int main() 
{
    // TODO
    int i;
    scanf_s("%d", &n);
    queen(1);
    cout << (cous);
}




//2)
//int n, P[21], H[21], R[41], L[41], cous=0;/*глобальные описания*/
///*P = Position (перестановка, выводимая на экран)
//H=Horizontal (0/1 занят ли горизонт на этой строке)
//R=Right Diagonal (занята ли диагональ на диагонали идущая в правый верхний угол)
//L=Left Diagonal (занята ли диагональ на диагонали идущая в левый верхний угол)
//*/
//void queen(int k)      
//{
//    int i, j;
//    for (i = 1; i <= n; i++)
//    {
//        if (H[i] == 0 && R[i - k + 21] == 0 && L[i + k] == 0)
//        {
//            P[k] = i; H[i] = 1; R[i - k + 21] = 1; L[i + k] = 1;
//            if (k == n)      
//            {
//                for (j = 1; j <= n; j++) printf("%2d ", P[j]);
//                printf("\n");
//                cous += 1;
//            }
//            else queen(k + 1);
//            H[i] = 0; R[i - k + 21] = 0; L[i + k] = 0;
//        }
//    }
//
//}
//
//int main() {
//    // TODO
//    int i;
//    scanf_s("%d", &n);
//    for (i = 1; i <= n; i++) H[i] = 0;
//    for (i = 2; i <= n + n; i++)
//    {
//        R[i] = 0; L[i] = 0;
//    }
//    queen(1);
//    cout << (cous);
//}
